In [1]:
import numpy as np
import pandas as pd
from pandas import Series, DataFrame

In [2]:
dframe = DataFrame({'k1': ['X','X','Y','Y','Z'], 
                    'k2': ['alpha','beta','alpha','beta', 'alpha'], 
                    'dataset1': np.random.randn(5), 
                    'dataset2': np.random.randn(5)})
dframe

  k1     k2  dataset1  dataset2
0  X  alpha  2.041560  0.421212
1  X   beta -1.078295 -0.516398
2  Y  alpha -0.028731  1.220723
3  Y   beta  0.352684 -0.247275
4  Z  alpha -0.163329  0.505593

In [3]:
group1 = dframe['dataset1'].groupby(dframe['k1'])

In [4]:
#jika memanggil group1 cuma menampilkan notifikasi konfirmasi saja
group1

In [5]:
#untuk menampilkan nilai harus melakukan operasi
#nilai X diambil dari dua nilai dataset yang memiliki k1 X, begitupun untuk Y dan Z
#terkhusus Z, nilai masih tetap sama seperti di dframe karena nilainya cuma 1
group1.mean()

k1
X    0.481633
Y    0.161977
Z   -0.163329
Name: dataset1, dtype: float64

In [6]:
#groupby tapi dengan menggunakan value tambahan, contoh:
cities = np.array(['NY', 'LA','LA', 'NY', 'NY'])
month = np.array(['JAN', 'FEB', 'JAN', 'FEB', 'JAN'])

In [7]:
#mencocokkan nilai ybs dengan nilai index
#misal: LA-FEB dalam dataset1 ada pada index 1, kemudian LA-JAN ada pada index 2, kemudian di dataset1 dframe dimasukkan nilai itu
dframe['dataset1'].groupby([cities, month]).mean()

LA  FEB   -1.078295
    JAN   -0.028731
NY  FEB    0.352684
    JAN    0.939116
Name: dataset1, dtype: float64

In [8]:
dframe

  k1     k2  dataset1  dataset2
0  X  alpha  2.041560  0.421212
1  X   beta -1.078295 -0.516398
2  Y  alpha -0.028731  1.220723
3  Y   beta  0.352684 -0.247275
4  Z  alpha -0.163329  0.505593

In [9]:
#bisa melakukan groupby dari mean juga untuk melihat mean dari tiap dataset
dframe.groupby('k1').mean()

    dataset1  dataset2
k1
X   0.481633 -0.047593
Y   0.161977  0.486724
Z  -0.163329  0.505593

In [10]:
#group by bisa juga dilakukan dengan lebih dari satu key
#menampilkan hasil yang sama saja seperti dframe biasa, karena tidak ada mean yang dihitung
dframe.groupby(['k1','k2']).mean()

          dataset1  dataset2
k1 k2
X  alpha  2.041560  0.421212
   beta  -1.078295 -0.516398
Y  alpha -0.028731  1.220723
   beta   0.352684 -0.247275
Z  alpha -0.163329  0.505593

In [11]:
#melihat ada berapa X k1, Y k1, dst (?)
#jadi menampilkan ada dua X, dua Y, dan satu Z
dframe.groupby(['k1']).size()

k1
X    2
Y    2
Z    1
dtype: int64

In [12]:
#kita juga bisa mencetak nama dan value dari group tersebut
dframe

  k1     k2  dataset1  dataset2
0  X  alpha  2.041560  0.421212
1  X   beta -1.078295 -0.516398
2  Y  alpha -0.028731  1.220723
3  Y   beta  0.352684 -0.247275
4  Z  alpha -0.163329  0.505593

In [13]:
#name merupakan nama dari k1, sementara group merupakan nilai dari baris k1 tersebut
for name, group in dframe.groupby('k1'):
    print("This is the %s group" %name)
    print(group)
    print('\n')

This is the X group
  k1     k2  dataset1  dataset2
0  X  alpha  2.041560  0.421212
1  X   beta -1.078295 -0.516398


This is the Y group
  k1     k2  dataset1  dataset2
2  Y  alpha -0.028731  1.220723
3  Y   beta  0.352684 -0.247275


This is the Z group
  k1     k2  dataset1  dataset2
4  Z  alpha -0.163329  0.505593

In [14]:
for (k1, k2), group in dframe.groupby(['k1','k2']):
    print('Key1=%s Key2=%s' %(k1,k2))
    print(group)
    print('\n')

Key1=X Key2=alpha
  k1     k2  dataset1  dataset2
0  X  alpha   2.04156  0.421212


Key1=X Key2=beta
  k1    k2  dataset1  dataset2
1  X  beta -1.078295 -0.516398


Key1=Y Key2=alpha
  k1     k2  dataset1  dataset2
2  Y  alpha -0.028731  1.220723


Key1=Y Key2=beta
  k1    k2  dataset1  dataset2
3  Y  beta  0.352684 -0.247275


Key1=Z Key2=alpha
  k1     k2  dataset1  dataset2
4  Z  alpha -0.163329  0.505593

In [15]:
#bagaimana kalau kita mengubah variabel group? 
for name, hehe in dframe.groupby('k1'):
    print("This is the %s group" %name)
    print(hehe)
    print('\n')
    
#variable group bisa diganti dengan variabel lain. contohnya hehe

This is the X group
  k1     k2  dataset1  dataset2
0  X  alpha  2.041560  0.421212
1  X   beta -1.078295 -0.516398


This is the Y group
  k1     k2  dataset1  dataset2
2  Y  alpha -0.028731  1.220723
3  Y   beta  0.352684 -0.247275


This is the Z group
  k1     k2  dataset1  dataset2
4  Z  alpha -0.163329  0.505593

In [16]:
group_dict = dict(list(dframe.groupby('k1')))

In [17]:
#untuk menyimpan groupby kita bisa dengan membuat dictionary
#kemudian kita memanggil index tersebut
group_dict['X']

  k1     k2  dataset1  dataset2
0  X  alpha  2.041560  0.421212
1  X   beta -1.078295 -0.516398

In [18]:
group_dict_axis1 = dict(list(dframe.groupby(dframe.dtypes, axis=1)))

In [19]:
#membagi kedua dframe tersebut sesuai dengan data types 
#oleh karena itu dictionary terbagi menjadi dua, yang pertama bertipe floating dan satu lagi bertpe string
group_dict_axis1

{dtype('float64'):    dataset1  dataset2
 0  2.041560  0.421212
 1 -1.078295 -0.516398
 2 -0.028731  1.220723
 3  0.352684 -0.247275
 4 -0.163329  0.505593, dtype('O'):   k1     k2
 0  X  alpha
 1  X   beta
 2  Y  alpha
 3  Y   beta
 4  Z  alpha}

In [20]:
group_dict_axis0 = dict(list(dframe.groupby(dframe.dtypes, axis=0)))

In [21]:
#kalau axis-0 tidak bisa
#karena tidak ada
#axis=1 sebenernya membagi data tipe berdasarkan kolom yang ada, kalau berdasar row, semua row nilainya memili dtype yang berbeda
group_dict_axis0

{}

In [22]:
dataset2_group = dframe.groupby(['k1', 'k2'])['dataset2']

In [23]:
#melihat mean dari dataset2 dalam kolom k1 dan k2
#karena dalam frame ini cuma ada satu nilai dataset2, maka nilai mean sesuai dengan nilai dataset2 
dataset2_group.mean()

k1  k2
X   alpha    0.421212
    beta    -0.516398
Y   alpha    1.220723
    beta    -0.247275
Z   alpha    0.505593
Name: dataset2, dtype: float64

In [24]:
dframe

  k1     k2  dataset1  dataset2
0  X  alpha  2.041560  0.421212
1  X   beta -1.078295 -0.516398
2  Y  alpha -0.028731  1.220723
3  Y   beta  0.352684 -0.247275
4  Z  alpha -0.163329  0.505593

## GroupBy on Dictionary and Series

In [25]:
animals = DataFrame(np.arange(16).reshape(4,4),
                   columns= ['W', 'X', 'Y', 'Z'],
                   index=['Dog', 'Cat', 'Bird', 'Mouse'])

In [26]:
animals

        W   X   Y   Z
Dog     0   1   2   3
Cat     4   5   6   7
Bird    8   9  10  11
Mouse  12  13  14  15

In [27]:
#mengganti value dari animals menjadi null
animals.loc[1:2, ['W', 'Y']] = np.nan

In [28]:
animals

          W   X     Y   Z
Dog     0.0   1   2.0   3
Cat     NaN   5   NaN   7
Bird    8.0   9  10.0  11
Mouse  12.0  13  14.0  15

In [29]:
behavior_map = {'W': 'good', 'X': 'bad', 'Y': 'good', 'Z': 'bad'}

In [30]:
#melakukan sorting berdasarkan kolom, oleh karena itulah ditambahkan parameter axis
#masih tetap harus belajar lagi mengenai kegunaan axis
#apa karena kalau tidak dibuat axis jadinya cuma melihat di kolom? sepertinya memang seperti itu
animal_col = animals.groupby(behavior_map, axis=1)

In [31]:
#perhatikan bahwa null berubah menjadi nilai 0 ketika dilakukan groupby
animal_col.sum()

        bad  good
Dog     4.0   2.0
Cat    12.0   0.0
Bird   20.0  18.0
Mouse  28.0  26.0

In [32]:
animal_col2 = animals.groupby(behavior_map)

In [33]:
animal_col2.sum()

Empty DataFrame
Columns: [W, X, Y, Z]
Index: []

In [34]:
#penggunaan axis=0 dengan experimen

In [35]:
reproductive_method = {'Dog': 'Vivipar', 'Cat': 'Vivipar', 'Bird': 'Ovipar', 'Mouse': 'Vivipar'}

In [36]:
animal_col3 = animals.groupby(reproductive_method)

In [37]:
#CONFRIMED. Axis=0 bisa juga digunakan untuk melihat tiap baris dari dframe
animal_col3.sum()

            W   X     Y   Z
Ovipar    8.0   9  10.0  11
Vivipar  12.0  19  16.0  25

In [38]:
#balik lagi ke animal_col

In [39]:
behav_series = Series(behavior_map)

In [40]:
behav_series

W    good
X     bad
Y    good
Z     bad
dtype: object

In [41]:
#melihat jumlah bad dan good yang terisi di tiap animal
#cat tidak terisi karena semua kolom good dari cat cuma terisi null
animals.groupby(behav_series, axis=1).count()

       bad  good
Dog      2     2
Cat      2     0
Bird     2     2
Mouse    2     2

In [42]:
#membagi animal berdasar huruf mereka, karena ada dua animal yang memiliki tiga huruf (Cat-Dog), maka keduanya bersatu
#semua kolom merupakan penjumlahan dari nilai dari ketiga animal tersebut
#W bernilai 0 karena baik Dog maupun Cat tidak memiliki nilai tersebut
animals.groupby(len).sum()

      W   X     Y   Z
3   0.0   6   2.0  10
4   8.0   9  10.0  11
5  12.0  13  14.0  15

In [43]:
keys = ['A', 'B', 'A', 'B']

In [44]:
#sejujurnya masih belum begitu mengerti 
animals.groupby([len, keys]).max()

        W   X     Y   Z
3 A   0.0   1   2.0   3
  B   NaN   5   NaN   7
4 A   8.0   9  10.0  11
5 B  12.0  13  14.0  15

In [45]:
keys2 = ['A', 'B', 'A', 'B', 'C']

In [46]:
#ERROR karena tidak memiliki length yang sama 
#animals.groupby([len, keys2]).max()

In [47]:
#bagaimana kalau Dog dan Cat berada di baris yang berbeda?

In [48]:
animals2 = DataFrame(np.arange(16).reshape(4,4),
                   columns= ['W', 'X', 'Y', 'Z'],
                   index=['Dog','Bird', 'Mouse', 'Cat'])

In [49]:
animals2

        W   X   Y   Z
Dog     0   1   2   3
Bird    4   5   6   7
Mouse   8   9  10  11
Cat    12  13  14  15

In [50]:
animals2.loc[3:4, ['W', 'Y']] = np.nan

In [51]:
animals2

         W   X     Y   Z
Dog    0.0   1   2.0   3
Bird   4.0   5   6.0   7
Mouse  8.0   9  10.0  11
Cat    NaN  13   NaN  15

In [52]:
animal_col4 = animals2.groupby(behavior_map, axis=1)

In [53]:
animal_col4.sum()

        bad  good
Dog     4.0   2.0
Bird   12.0  10.0
Mouse  20.0  18.0
Cat    28.0   0.0

In [54]:
#masih sama karena keys untuk Cat sama-sama B, jadi tidak sesuai dengan order 
animals2.groupby([len, keys]).max()

       W   X     Y   Z
3 A  0.0   1   2.0   3
  B  NaN  13   NaN  15
4 B  4.0   5   6.0   7
5 A  8.0   9  10.0  11

In [55]:
#bagaimana kalau Cats juga bernilai A?
keys3 = ['A', 'B', 'B', 'A']

In [56]:
#maka index 3 tidak memiliki nilai B, karena semua nilainya bernilai A (baik Dogs maupun Cats)
animals2.groupby([len, keys3]).max()

       W   X     Y   Z
3 A  0.0  13   2.0  15
4 B  4.0   5   6.0   7
5 B  8.0   9  10.0  11

In [57]:
#ayo kita balik lagi ke variabel animals

In [ ]:
#membuat group by dengan menggunakan method MultiIndex
#melakukan pengelompokkan berdasarkan kota?

In [58]:
hier_col = pd.MultiIndex.from_arrays([['NY','NY','NY','SF','SF'], [1,2,3,1,2]], names=['City', 'sub_value'])

In [59]:
dframe_hr = DataFrame(np.arange(25).reshape(5,5), columns=hier_col)

In [60]:
dframe_hr

City       NY          SF
sub_value   1   2   3   1   2
0           0   1   2   3   4
1           5   6   7   8   9
2          10  11  12  13  14
3          15  16  17  18  19
4          20  21  22  23  24